app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "worst article"], ["body", "not the best article"], ["updated_at", "2020-12-15 04:36:53.549994"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)